
/**
 * MWKCN Configuration
 * แก้ไขไฟล์นี้เพื่อเชื่อมต่อกับระบบหลังบ้าน
 */
const CONFIG = {
    // 1. นำ URL ของ Google Apps Script Web App มาวางที่นี่
    API_URL: 'https://script.google.com/macros/s/AKfycbypqNNQf4-HBcetryp5Gubjq556LuxzYSM_aokjRI-ks9s-sDF2gDONO8mAe6pQg6ey/exec',
    
    // 2. ข้อมูล PromptPay (เบอร์โทรศัพท์)
    PROMPTPAY_ID: "0908870278",
    
    // 3. ลิงก์ส่งสลิปทาง LINE
    REPORT_SLIP_LINK: "https://lin.ee/w6UjWRo/~732gwoku",
    
    // 4. ตั้งค่าเวลาปิดปรับปรุง (0=อาทิตย์, 6=เสาร์)
    MAINTENANCE_DAYS: [0, 6],
    TIMEZONE_OFFSET: 7, // GMT+7 (Thailand)
    
    // 5. รายชื่อนักเรียนหลัก (Master List)
    NAME_MASTER_LIST: {
        "1": "นายอินทัช ฐิติโชติตระกูล",
        "2": "น.ส.พัชลา บุญเลิศทรัพย์ทวี",
        "3": "นายคุณานนท์ สามัคคีก่อสกุล",
        "4": "นายชินกฤต โยธิยา",
        "5": "น.ส.จิตรา จือเต๊าะ",
        "6": "น.ส.นฤมล เยอะเบียง",
        "7": "น.ส.ปานตะวัน เพียงคำ",
        "8": "น.ส.ฐิตาพร มาเยอะ",
        "9": "น.ส.โนรา โหว่ยคือ",
        "10": "น.ส.มยุรี มาเยอะ",
        "11": "น.ส.ณัชชา หมื่อแล",
        "12": "น.ส.อพิญญา ศรีวิชัย",
        "13": "นายอนุรักษ์ แซ่ว่าง",
        "14": "น.ส.ดวงกมล มั่นคง",
        "15": "น.ส.มรกต ซางสุภาพ",
        "16": "น.ส.ติยนันท์ ฦาชา",
        "17": "น.ส.กกนกภรณ์ โสภณสุนทรเลิศ",
        "18": "น.ส.ณนิดา แซ่เติ๋ง",
        "19": "นายวิโรจน์ เยอแจะ",
        "20": "น.ส.ทองดี เรือนเเก้ว",
        "21": "นายทักษ์ดนัย โชคชัยรัตนกุล",
        "22": "นวพล สว่างถาวรกุล",
        "23": "นายรัชชานนท์ เหวยเหยอกู่",
        "24": "นายศุภกิจ แซ่หู่",
        "25": "น.ส.กชกร เหลาเหยา",
        "26": "น.ส.กัญญาพร อามอ",
        "27": "น.ส.ณิชากร อายี",
        "28": "น.ส.ธิดารัตน์ ละเชกุ",
        "29": "น.ส.นาธาร์ แลเชอ",
        "30": "น.ส.เนาวรัตน์ เชอหมื่อ",
        "31": "น.ส.เพชรรดา สีไอ้",
        "32": "น.ส.ภัคจีรา แซ่เห่อ",
        "33": "น.ส.สุปวีณ์ ขันอุละ",
        "34": "น.ส.ภัทรมล สหพรสันติสุข",
        "35": "น.ส.ธัญญลักษณ์ ทาเกิด",
        "36": "น.ส.วราภรณ์ เชอกอง",
        "37": "น.ส.ณัชนันท์ คำปวน",
        "38": "น.ส.กนกรดา มูเซอ",
        "39": "น.ส.นิชดา อาซอ",
        "40": "นายสุรเชษฐ์ กัลยา"
    }
};
